# INSPECTION Methods in pandas

In [2]:
import pandas as pd

data = {
    'Name': ['Ram', 'Shyam', 'Hari', 'Gita', 'Eva'],
    'Age': [25, 30, 35, 40, 28],
    'City': ['Kathmandu', 'Lalitpur', 'Bhaktapur', 'Pokhara', 'Butwal'],
    'Salary': [50000, 60000, 55000, 62000, 58000]
}

df = pd.DataFrame(data)

In [7]:
df.shape

(5, 4)

In [8]:
df.columns

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

In [18]:
df.index = ['A','B','C','D','E']
print(df)
print(df.set_index('Name'))

    Name  Age       City  Salary
A    Ram   25  Kathmandu   50000
B  Shyam   30   Lalitpur   60000
C   Hari   35  Bhaktapur   55000
D   Gita   40    Pokhara   62000
E    Eva   28     Butwal   58000
       Age       City  Salary
Name
Ram     25  Kathmandu   50000
Shyam   30   Lalitpur   60000
Hari    35  Bhaktapur   55000
Gita    40    Pokhara   62000
Eva     28     Butwal   58000

In [19]:
print(df.head())

    Name  Age       City  Salary
A    Ram   25  Kathmandu   50000
B  Shyam   30   Lalitpur   60000
C   Hari   35  Bhaktapur   55000
D   Gita   40    Pokhara   62000
E    Eva   28     Butwal   58000

In [20]:
print(df.tail())

    Name  Age       City  Salary
A    Ram   25  Kathmandu   50000
B  Shyam   30   Lalitpur   60000
C   Hari   35  Bhaktapur   55000
D   Gita   40    Pokhara   62000
E    Eva   28     Butwal   58000

In [21]:
print(df.describe())

            Age       Salary
count   5.00000      5.00000
mean   31.60000  57000.00000
std     5.94138   4690.41576
min    25.00000  50000.00000
25%    28.00000  55000.00000
50%    30.00000  58000.00000
75%    35.00000  60000.00000
max    40.00000  62000.00000

In [3]:
df.dtypes

Name      object
Age        int64
City      object
Salary     int64
dtype: object

In [4]:
df.values

array([['Ram', 25, 'Kathmandu', 50000],
       ['Shyam', 30, 'Lalitpur', 60000],
       ['Hari', 35, 'Bhaktapur', 55000],
       ['Gita', 40, 'Pokhara', 62000],
       ['Eva', 28, 'Butwal', 58000]], dtype=object)